function generator(){
  let male = {
    А:["Аввакум","Аваз","Агап","Агафон","Август","Августин","Аггей","Авраам","Абрам","Аарон","Автандил","Авдей","Авдей","Азарий","Арам","Аркадий","Арий","Аристарх","Арно","Арон","Арнольд","Арсен, Арсений","Архип","Артур","Артем","Артемий","Акакий","Алан","Ален","Аким","Альберт","Альфред","Александр","Алексей","Амвросий","Анатолий","Амадей","Амадеус","Амаяк","Анисим","Апполинарий","Антон","Ануфрий","Ануфрий","Андрей","Аскольд","Афанасий","Ахмет","Адам","Адриан","Адольф","Ашот"],
    Б:["Бронислав","Богдан","Борис","Борислав","Болеслав","Бонифаций","Бернар","Бенедикт"],
    В:["Варлаам","Варфоломей","Вальтер","Валерий","Валентин","Василий","Вадим","Вацлав","Владимир","Владислав","Владлен","Виктор","Вильгельм","Вилен","Викентий","Виссарион","Виталий","Витольд","Володар","Вольдемар","Всеволод","Велизар","Вениамин","Венедикт","Вячеслав"],
    Г:["Гавриил","Гастон","Градимир","Григорий","Глеб","Горислав","Гордон","Гордей","Густав","Гевор","Геральд","Герасим","Герман","Георгий","Генрих","Геннадий"],
    Д:["Давид","Дамир","Даниил","Динасий","Дорофей","Дмитрий","Дональд","Донат","Денис","Демид","Демьян","Джордан"],
    Е:["Евграф","Евгений","Егор","Евстафий","Евсей","Евдоким","Ермолай","Ерофей","Еремей","Елизар","Елисей","Емельян","Ефрем","Ефим","Ефимий"],
    Ж:["Жан","Жорж","Ждан"],
    З:["Захар","Захария","Зигмунд","Зиновий","Зосима"],
    И:["Иван","Ибрагим","Игнат","Игнатий","Игорь","Израиль","Измаил","Изяслав","Ираклий","Иржи","Иларион","Илларион","Илиан","Ион","Ипполит","Иннокентий","Ионос","Ионас","Иосиф","Исаак","Исаакий","Исидор","Иероним"],
    К:["Казимир","Карл","Карен","Клавдий","Кирилл","Клим","Климент","Ким","Клод","Клемент","Корнилий","Корней","Конрад","Конкордий","Константин","Кондрат","Ксаннф","Кузьма"],
    Л:["Лаврентий","Лазарь","Лука","Лукьян","Лев","Леван","Леон","Леонард","Леонид","Леопольд","Леонтий","Любомир","Люсьен","Людвиг"],
    М:["Марат","Марк","Мариан","Мартин","Мартын","Май","Макар","Максим","Максимилиан","Мануил","Матвей","Мадлен","Мирон","Мирослав","Милан","Мисаил","Михаил","Митрофан","Мичлов","Моисей","Модест","Мстислав","Мурат","Муслим","Мефодий","Мечислав","Мечеслав"],
    Н:["Назар","Назарий","Натан","Наум","Никанор","Никита","Никифор","Николай","Никон","Нисон","Нифонт","Норман","Нестор"],
    О:["Овидий","Олан","Олег","Онисим","Оскар","Осип"],
    П:["Павел","Парамон","Панкрат","Памфил","Прокофий","Прохор","Платон","Пимен","Порфирий","Петр"],
    Р:["Равиль","Раймонд","Рафаил","Рафик","Ратмир","Радий","Радий","Радомир","Рашид","Ринат","Рихард","Рифат","Ричард","Роберт","Ролан","Роман","Ростислав","Родион","Рубен","Руслан","Рустам","Рудольф","Рем","Ренольд"],
    С:["Савва","Савел","Савелий","Самсон","Самуил","Святослав","Спартак","Сократ","Соломон","Стакрат","Станимир","Станислав","Стивен","Стоян","Степан","Севастьян","Северин","Серафим","Сергей","Семен"],
    Т:["Тарас","Талик","Таис","Тамаз","Трифон","Трофим","Тигран","Тимон","Тимофей","Тимур","Тит","Тихон","Терентий","Тельман","Теодор"],
    У:["Ульманас","Устин"],
    Ф:["Франц","Фридрих","Филипп","Филимон","Флорентий","Фидель","Фома","Фердинанд","Феликс","Феодосий","Федор","Федот"],
    Х:["Харитон","Христиан","Христос","Христофор"],
    Э:["Эраст","Эрик","Эрнест","Эльдар","Эмиль","Эммануил","Эдвард","Эдмунд","Эдуард"],
    Ю:["Юрий","Юлиан","Юлий","Юхим"],
    Я:["Яромир","Ярослав","Яким","Яков","Ян","Януарий","Ясон"]}
  let female = {А:["Августа","Аврора","Агата","Агнесса","Агния","Ада","Азиза","Алевтина","Александра","Алёна","Алина","Алиса","Алла","Альбина","Амелия","Анастасия","Ангелина","Анжела","Анисья","Анна","Антонина","Анфиса","Ариадна","Арина","Астра","Ася"],
    Б:["Беатриса","Белла","Берта","Божена","Борислава","Бронислава"],
    В:["Валентина","Валерия","Ванда","Варвара","Василиса","Венера","Вера","Вероника","Веста","Вета","Виктория","Виолетта","Виталина","Владислава"],
    Г:["Галина","Гаянэ","Гелла","Генриетта","Георгина","Гертруда","Глафира","Грета","Гюзель"],
    Д:["Дана","Даниэла","Дарина","Дарья","Дебора","Диана","Дина","Динара","Дионисия","Доминика"],
    Е:["Ева","Евгения","Евдокия","Екатерина","Елена","Елизавета"],
    Ж:["Жанна"],
    З:["Земфира","Зинаида","Злата","Зоя"],
    И:["Изабелла","Изольда","Инга","Инесса","Инна","Иоанна","Иоланта","Ираида","Ирина","Ирма","Ия"],
    К:["Калерия","Камилла","Капитолина","Карина","Каролина","Кира","Клавдия","Клара","Констанция","Кристина","Ксения"],
    Л:["Лада","Лариса","Лаура","Лейла","Леся","Лидия","Лилия","Лина","Лия","Любовь","Людмила","Люсьена"],
    М:["Майя","Маргарита","Марианна","Марина","Мария","Марта","Марьяна","Медея","Милена","Милица","Милослава","Мирослава","Моника","Муза"],
    Н:["Надежда","Наталья","Нелли","Ника","Нина","Нонна"],
    О:["Оксана","Октябрина","Олеся","Ольга"],
    П:["Полина","Прасковья"],
    Р:["Рада","Раиса","Ревекка","Регина","Рената","Римма","Роза","Роксана","Ростислава","Рузана","Руслана","Руфина"],
    С:["Сабина","Сарра","Светлана","Серафима","Сильва","Симона","Снежана","Софья","Станислава","Стелла","Стефания","Сусанна"],
    Т:["Таисия","Тамара","Татьяна","Тереза"],
    У:["Ульяна","Устина"],
    Ф:["Фаина","Фаня","Фая","Фелиция","Флора","Франсуаза","Фрида"],
    Х:["Хильда","Христина"],
    Ч:["Чеслава"],
    Э:["Эдита","Элеонора","Элина","Элла","Элоиза","Эльвира","Эльза","Эльмира","Эмилия","Эмма","Эрика"],
    Ю:["Юлия","Юна","Юнона","Юстина"],
    Я:["Ядвига","Яна","Ярослава"]}

  //выбираем случайные имена и имена для отчеств из полученных массивов
  let gender = Math.floor(Math.random() * Math.floor(2))
  let indexFirstLetter = Math.floor(Math.random() * Math.floor(Object.keys(male).length))
  let firstLetter = Object.keys(male)[indexFirstLetter]
  let randNamePos = (gender) ? Math.floor(Math.random() * Math.floor(male[firstLetter].length)) : Math.floor(Math.random() * Math.floor(female[firstLetter].length))
  let randName = (gender) ? male[firstLetter][randNamePos] : female[firstLetter][randNamePos]
  let indexFatherFirstLetter = Math.floor(Math.random() * Math.floor(Object.keys(male).length))
  let fatherFirstLetter = Object.keys(male)[indexFatherFirstLetter]
  let randFatherPos = Math.floor(Math.random() * Math.floor(male[fatherFirstLetter].length))
  let randFather = male[fatherFirstLetter][randFatherPos]
  let fatherEnd = randFather.slice(randFather.length-2, randFather.length)
  let fatherRoot = randFather.slice(0, randFather.length-2)
//задаём стандартные значения окончаний для м/ж отчеств
  let genderEnd = "на";if (gender) genderEnd = "ич"
//проверяем случаи имён, исправляем в зависимости отчества.
  switch (fatherEnd){
    case "ий": randFather = fatherRoot+"ьев"; break;
    case "ов": randFather = fatherRoot+"ов"; break;
    case "ль": randFather = fatherRoot+"льев"; break;
    case "ма": randFather = fatherRoot+"мов"; break;
    case "ей": randFather = fatherRoot+"еев"; break;
    case "ва": randFather = fatherRoot+"вов"; break;
    case "ья": randFather = fatherRoot+"ь"; break;
    case "ай": randFather = fatherRoot+"ев"; break;
    case "ел": randFather = fatherRoot+"ельев"; break;
    default: randFather +="ов"; break;
  }
//выводим получившиеся имя
  return randName + " " + randFather + genderEnd;
}
